Section_4_Real_Workload_Validation/Experiment13/data/raw/case-C/sustained-ramp/trial_010/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 16.938ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 16.962ms, rate sampling interval: 36ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.12ms    3.54ms  72.00ms   83.78%
    Req/Sec   151.79     72.73   400.00     72.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.49ms
 75.000%   17.53ms
 90.000%   19.45ms
 99.000%   30.70ms
 99.900%   41.82ms
 99.990%   58.24ms
 99.999%   71.93ms
100.000%   72.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.431     0.000000            1         1.00
      12.831     0.100000         5131         1.11
      13.495     0.200000        10207         1.25
      14.119     0.300000        15314         1.43
      14.783     0.400000        20390         1.67
      15.495     0.500000        25525         2.00
      15.855     0.550000        28064         2.22
      16.255     0.600000        30596         2.50
      16.671     0.650000        33211         2.86
      17.103     0.700000        35743         3.33
      17.535     0.750000        38219         4.00
      17.775     0.775000        39543         4.44
      18.015     0.800000        40823         5.00
      18.271     0.825000        42048         5.71
      18.591     0.850000        43371         6.67
      18.943     0.875000        44608         8.00
      19.183     0.887500        45249         8.89
      19.455     0.900000        45872        10.00
      19.807     0.912500        46506        11.43
      20.303     0.925000        47144        13.33
      20.927     0.937500        47773        16.00
      21.263     0.943750        48093        17.78
      21.711     0.950000        48419        20.00
      22.239     0.956250        48732        22.86
      22.831     0.962500        49050        26.67
      23.727     0.968750        49365        32.00
      24.271     0.971875        49527        35.56
      25.039     0.975000        49683        40.00
      25.855     0.978125        49841        45.71
      26.687     0.981250        50003        53.33
      27.823     0.984375        50161        64.00
      28.351     0.985938        50238        71.11
      29.183     0.987500        50318        80.00
      30.111     0.989062        50397        91.43
      31.023     0.990625        50478       106.67
      32.143     0.992188        50557       128.00
      32.671     0.992969        50596       142.22
      33.343     0.993750        50636       160.00
      34.271     0.994531        50676       182.86
      35.423     0.995313        50717       213.33
      36.223     0.996094        50757       256.00
      36.575     0.996484        50775       284.44
      37.023     0.996875        50795       320.00
      37.599     0.997266        50815       365.71
      38.527     0.997656        50835       426.67
      39.583     0.998047        50855       512.00
      39.999     0.998242        50865       568.89
      40.383     0.998437        50876       640.00
      40.863     0.998633        50885       731.43
      41.343     0.998828        50895       853.33
      41.919     0.999023        50907      1024.00
      42.111     0.999121        50910      1137.78
      43.167     0.999219        50915      1280.00
      44.159     0.999316        50920      1462.86
      45.023     0.999414        50925      1706.67
      46.175     0.999512        50930      2048.00
      46.303     0.999561        50932      2275.56
      46.815     0.999609        50935      2560.00
      48.255     0.999658        50937      2925.71
      50.719     0.999707        50940      3413.33
      51.455     0.999756        50942      4096.00
      51.615     0.999780        50943      4551.11
      53.087     0.999805        50945      5120.00
      53.663     0.999829        50946      5851.43
      56.863     0.999854        50948      6826.67
      56.863     0.999878        50948      8192.00
      58.239     0.999890        50949      9102.22
      58.367     0.999902        50950     10240.00
      58.367     0.999915        50950     11702.86
      60.895     0.999927        50951     13653.33
      60.895     0.999939        50951     16384.00
      60.991     0.999945        50952     18204.44
      60.991     0.999951        50952     20480.00
      60.991     0.999957        50952     23405.71
      71.935     0.999963        50953     27306.67
      71.935     0.999969        50953     32768.00
      71.935     0.999973        50953     36408.89
      71.935     0.999976        50953     40960.00
      71.935     0.999979        50953     46811.43
      72.063     0.999982        50954     54613.33
      72.063     1.000000        50954          inf
#[Mean    =       16.117, StdDeviation   =        3.543]
#[Max     =       72.000, Total count    =        50954]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  54002 requests in 3.00m, 43.93MB read
Requests/sec:    299.99
Transfer/sec:    249.89KB